spec/fixtures/cassettes/BookingSync_API_Client_Payments/_payments/returns_payments.yml

---
http_interactions:
- request:
    method: get
    uri: https://www.bookingsync.com/api/v3/payments
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.0
      Accept:
      - application/vnd.api+json
      Content-Type:
      - application/vnd.api+json
      Authorization:
      - Bearer <<ACCESS_TOKEN>>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Ratelimit-Limit:
      - '1000'
      X-Ratelimit-Reset:
      - '1398171600'
      X-Ratelimit-Remaining:
      - '999'
      Link:
      - "<https://www.bookingsync.com/api/v3/payments?page=1>; rel=\"first\", <https://www.bookingsync.com/api/v3/payments?page=2>;
        rel=\"next\", <https://www.bookingsync.com/api/v3/payments?page=3>; rel=\"last\""
      X-Total-Pages:
      - '3'
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Request-Method:
      - "*"
      Content-Type:
      - application/vnd.api+json; charset=utf-8
      X-Ua-Compatible:
      - IE=Edge
      Etag:
      - "\"e596806dc3f0c3f91d4aea5c73d91ea2\""
      Cache-Control:
      - max-age=0, private, must-revalidate
      P3p:
      - CP="OTI DSP COR CUR ADMo DEVo TAI PSAi PSDi IVAi IVDi CONi HISi TELi OTPi
        OUR SAMi OTRo UNRo PUBi IND UNI STA"
      X-Request-Id:
      - 849cb70014c3da4ec8f4c38df50881b3
      X-Runtime:
      - '0.864469'
      Date:
      - Tue, 22 Apr 2014 12:00:18 GMT
      Connection:
      - close
    body:
      encoding: UTF-8
      string: "{\"links\":{\"payments.billing_address\":\"https://www.bookingsync.com/api/v3/billing_addresses/{payments.billing_address}\",\"payments.bookings\":\"https://www.bookingsync.com/api/v3/bookings/{payments.bookings}\",\"payments.bookings_payments\":\"https://www.bookingsync.com/api/v3/bookings_payments/{payments.bookings_payments}\"},\"payments\":[{\"links\":{\"billing_address\":null,\"bookings\":[2],\"bookings_payments\":[1]},\"id\":1,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":33000,\"currency\":\"GBP\",\"kind\":\"cash\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-21T13:18:42Z\",\"created_at\":\"2014-04-14T13:18:42Z\",\"updated_at\":\"2014-04-14T13:18:42Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[5],\"bookings_payments\":[2]},\"id\":2,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":125200,\"currency\":\"EUR\",\"kind\":\"cash\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-04-07T13:18:42Z\",\"created_at\":\"2014-04-14T13:18:42Z\",\"updated_at\":\"2014-04-22T11:23:32Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[6],\"bookings_payments\":[3]},\"id\":3,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":39300,\"currency\":\"USD\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-15T13:18:46Z\",\"created_at\":\"2014-04-14T13:18:46Z\",\"updated_at\":\"2014-04-14T13:18:46Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[7],\"bookings_payments\":[4]},\"id\":4,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":24500,\"currency\":\"USD\",\"kind\":\"online\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-26T13:18:46Z\",\"created_at\":\"2014-04-14T13:18:46Z\",\"updated_at\":\"2014-04-14T13:18:46Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[7],\"bookings_payments\":[5]},\"id\":5,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":98000,\"currency\":\"USD\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-04T13:18:46Z\",\"created_at\":\"2014-04-14T13:18:46Z\",\"updated_at\":\"2014-04-14T13:18:46Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[9],\"bookings_payments\":[6]},\"id\":6,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":9500,\"currency\":\"USD\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-04-02T13:18:47Z\",\"created_at\":\"2014-04-14T13:18:47Z\",\"updated_at\":\"2014-04-14T13:18:47Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[9],\"bookings_payments\":[7]},\"id\":7,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":28500,\"currency\":\"USD\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-20T13:18:47Z\",\"created_at\":\"2014-04-14T13:18:47Z\",\"updated_at\":\"2014-04-14T13:18:47Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[10],\"bookings_payments\":[8]},\"id\":8,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":38400,\"currency\":\"GBP\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-04-14T13:18:47Z\",\"created_at\":\"2014-04-14T13:18:47Z\",\"updated_at\":\"2014-04-14T13:18:47Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[10],\"bookings_payments\":[9]},\"id\":9,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":51200,\"currency\":\"GBP\",\"kind\":\"cash\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-19T13:18:47Z\",\"created_at\":\"2014-04-14T13:18:47Z\",\"updated_at\":\"2014-04-14T13:18:47Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[11],\"bookings_payments\":[10]},\"id\":10,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":47300,\"currency\":\"EUR\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-04-05T13:18:52Z\",\"created_at\":\"2014-04-14T13:18:52Z\",\"updated_at\":\"2014-04-14T13:18:52Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[11],\"bookings_payments\":[11]},\"id\":11,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":189200,\"currency\":\"EUR\",\"kind\":\"online\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-02T13:18:52Z\",\"created_at\":\"2014-04-14T13:18:52Z\",\"updated_at\":\"2014-04-14T13:18:52Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[11],\"bookings_payments\":[12]},\"id\":12,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":236500,\"currency\":\"EUR\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-18T13:18:52Z\",\"created_at\":\"2014-04-14T13:18:52Z\",\"updated_at\":\"2014-04-14T13:18:52Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[12],\"bookings_payments\":[13]},\"id\":13,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":118800,\"currency\":\"EUR\",\"kind\":\"cash\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-20T13:18:52Z\",\"created_at\":\"2014-04-14T13:18:52Z\",\"updated_at\":\"2014-04-14T13:18:52Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[12],\"bookings_payments\":[14]},\"id\":14,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":79200,\"currency\":\"EUR\",\"kind\":\"online\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-10T13:18:52Z\",\"created_at\":\"2014-04-14T13:18:52Z\",\"updated_at\":\"2014-04-14T13:18:52Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[13],\"bookings_payments\":[15]},\"id\":15,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":170800,\"currency\":\"USD\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-07T13:18:52Z\",\"created_at\":\"2014-04-14T13:18:52Z\",\"updated_at\":\"2014-04-14T13:18:52Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[13],\"bookings_payments\":[16]},\"id\":16,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":85400,\"currency\":\"USD\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-17T13:18:52Z\",\"created_at\":\"2014-04-14T13:18:52Z\",\"updated_at\":\"2014-04-14T13:18:52Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[13],\"bookings_payments\":[17]},\"id\":17,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":170800,\"currency\":\"USD\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-19T13:18:52Z\",\"created_at\":\"2014-04-14T13:18:52Z\",\"updated_at\":\"2014-04-14T13:18:52Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[14],\"bookings_payments\":[18]},\"id\":18,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":90000,\"currency\":\"EUR\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-06T13:18:53Z\",\"created_at\":\"2014-04-14T13:18:53Z\",\"updated_at\":\"2014-04-14T13:18:53Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[15],\"bookings_payments\":[19]},\"id\":19,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":117200,\"currency\":\"EUR\",\"kind\":\"online\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-21T13:18:53Z\",\"created_at\":\"2014-04-14T13:18:53Z\",\"updated_at\":\"2014-04-14T13:18:53Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[15],\"bookings_payments\":[20]},\"id\":20,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":58600,\"currency\":\"EUR\",\"kind\":\"online\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-02T13:18:53Z\",\"created_at\":\"2014-04-14T13:18:53Z\",\"updated_at\":\"2014-04-14T13:18:53Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[15],\"bookings_payments\":[21]},\"id\":21,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":117200,\"currency\":\"EUR\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-19T13:18:53Z\",\"created_at\":\"2014-04-14T13:18:53Z\",\"updated_at\":\"2014-04-14T13:18:53Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[16],\"bookings_payments\":[22]},\"id\":22,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":18400,\"currency\":\"GBP\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-04-09T13:18:57Z\",\"created_at\":\"2014-04-14T13:18:57Z\",\"updated_at\":\"2014-04-14T13:18:57Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[17],\"bookings_payments\":[23]},\"id\":23,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":6200,\"currency\":\"EUR\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-14T13:18:57Z\",\"created_at\":\"2014-04-14T13:18:57Z\",\"updated_at\":\"2014-04-14T13:18:57Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[17],\"bookings_payments\":[24]},\"id\":24,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":24800,\"currency\":\"EUR\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-03T13:18:57Z\",\"created_at\":\"2014-04-14T13:18:57Z\",\"updated_at\":\"2014-04-14T13:18:57Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[19],\"bookings_payments\":[25]},\"id\":25,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":10500,\"currency\":\"GBP\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-16T13:18:57Z\",\"created_at\":\"2014-04-14T13:18:57Z\",\"updated_at\":\"2014-04-14T13:18:57Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[19],\"bookings_payments\":[26]},\"id\":26,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":31500,\"currency\":\"GBP\",\"kind\":\"online\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-14T13:18:58Z\",\"created_at\":\"2014-04-14T13:18:58Z\",\"updated_at\":\"2014-04-14T13:18:58Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[19],\"bookings_payments\":[27]},\"id\":27,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":63000,\"currency\":\"GBP\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-19T13:18:58Z\",\"created_at\":\"2014-04-14T13:18:58Z\",\"updated_at\":\"2014-04-14T13:18:58Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[20],\"bookings_payments\":[28]},\"id\":28,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":34200,\"currency\":\"EUR\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-12T13:18:58Z\",\"created_at\":\"2014-04-14T13:18:58Z\",\"updated_at\":\"2014-04-14T13:18:58Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[20],\"bookings_payments\":[29]},\"id\":29,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":45600,\"currency\":\"EUR\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-04-13T13:18:58Z\",\"created_at\":\"2014-04-14T13:18:58Z\",\"updated_at\":\"2014-04-14T13:18:58Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[21],\"bookings_payments\":[30]},\"id\":30,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":31000,\"currency\":\"EUR\",\"kind\":\"online\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-23T13:19:02Z\",\"created_at\":\"2014-04-14T13:19:02Z\",\"updated_at\":\"2014-04-14T13:19:02Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[21],\"bookings_payments\":[31]},\"id\":31,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":31000,\"currency\":\"EUR\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-15T13:19:02Z\",\"created_at\":\"2014-04-14T13:19:02Z\",\"updated_at\":\"2014-04-14T13:19:02Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[22],\"bookings_payments\":[32]},\"id\":32,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":24400,\"currency\":\"USD\",\"kind\":\"online\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-04-13T13:19:03Z\",\"created_at\":\"2014-04-14T13:19:03Z\",\"updated_at\":\"2014-04-14T13:19:03Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[22],\"bookings_payments\":[33]},\"id\":33,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":24400,\"currency\":\"USD\",\"kind\":\"cash\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-27T13:19:03Z\",\"created_at\":\"2014-04-14T13:19:03Z\",\"updated_at\":\"2014-04-14T13:19:03Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[24],\"bookings_payments\":[34]},\"id\":34,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":8400,\"currency\":\"EUR\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-16T13:19:03Z\",\"created_at\":\"2014-04-14T13:19:03Z\",\"updated_at\":\"2014-04-14T13:19:03Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[24],\"bookings_payments\":[35]},\"id\":35,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":4200,\"currency\":\"EUR\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-14T13:19:03Z\",\"created_at\":\"2014-04-14T13:19:03Z\",\"updated_at\":\"2014-04-14T13:19:03Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[25],\"bookings_payments\":[36]},\"id\":36,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":15400,\"currency\":\"EUR\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-04-03T13:19:03Z\",\"created_at\":\"2014-04-14T13:19:03Z\",\"updated_at\":\"2014-04-14T13:19:03Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[26],\"bookings_payments\":[37]},\"id\":37,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":27200,\"currency\":\"EUR\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-22T13:19:07Z\",\"created_at\":\"2014-04-14T13:19:07Z\",\"updated_at\":\"2014-04-14T13:19:07Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[26],\"bookings_payments\":[38]},\"id\":38,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":40800,\"currency\":\"EUR\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-18T13:19:07Z\",\"created_at\":\"2014-04-14T13:19:07Z\",\"updated_at\":\"2014-04-14T13:19:07Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[26],\"bookings_payments\":[39]},\"id\":39,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":68000,\"currency\":\"EUR\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-15T13:19:08Z\",\"created_at\":\"2014-04-14T13:19:08Z\",\"updated_at\":\"2014-04-14T13:19:08Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[27],\"bookings_payments\":[40]},\"id\":40,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":22300,\"currency\":\"EUR\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-18T13:19:08Z\",\"created_at\":\"2014-04-14T13:19:08Z\",\"updated_at\":\"2014-04-14T13:19:08Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[27],\"bookings_payments\":[41]},\"id\":41,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":22300,\"currency\":\"EUR\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-15T13:19:08Z\",\"created_at\":\"2014-04-14T13:19:08Z\",\"updated_at\":\"2014-04-14T13:19:08Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[27],\"bookings_payments\":[42]},\"id\":42,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":178400,\"currency\":\"EUR\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-04-05T13:19:08Z\",\"created_at\":\"2014-04-14T13:19:08Z\",\"updated_at\":\"2014-04-14T13:19:08Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[28],\"bookings_payments\":[43]},\"id\":43,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":43800,\"currency\":\"GBP\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-04-06T13:19:08Z\",\"created_at\":\"2014-04-14T13:19:08Z\",\"updated_at\":\"2014-04-14T13:19:08Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[29],\"bookings_payments\":[44]},\"id\":44,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":66300,\"currency\":\"EUR\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-25T13:19:08Z\",\"created_at\":\"2014-04-14T13:19:08Z\",\"updated_at\":\"2014-04-14T13:19:08Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[30],\"bookings_payments\":[45]},\"id\":45,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":26400,\"currency\":\"EUR\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-13T13:19:08Z\",\"created_at\":\"2014-04-14T13:19:08Z\",\"updated_at\":\"2014-04-14T13:19:08Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[30],\"bookings_payments\":[46]},\"id\":46,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":26400,\"currency\":\"EUR\",\"kind\":\"paypal\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-12T13:19:08Z\",\"created_at\":\"2014-04-14T13:19:08Z\",\"updated_at\":\"2014-04-14T13:19:08Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[31],\"bookings_payments\":[47]},\"id\":47,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":35000,\"currency\":\"USD\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-15T13:19:13Z\",\"created_at\":\"2014-04-14T13:19:13Z\",\"updated_at\":\"2014-04-14T13:19:13Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[31],\"bookings_payments\":[48]},\"id\":48,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":17500,\"currency\":\"USD\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-18T13:19:13Z\",\"created_at\":\"2014-04-14T13:19:13Z\",\"updated_at\":\"2014-04-14T13:19:13Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[32],\"bookings_payments\":[49]},\"id\":49,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":20100,\"currency\":\"USD\",\"kind\":\"wiretransfer\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-02-20T13:19:13Z\",\"created_at\":\"2014-04-14T13:19:13Z\",\"updated_at\":\"2014-04-14T13:19:13Z\",\"rejected_at\":null,\"canceled_at\":null},{\"links\":{\"billing_address\":null,\"bookings\":[32],\"bookings_payments\":[50]},\"id\":50,\"account_id\":1,\"transaction_id\":null,\"order_id\":null,\"card\":null,\"amount\":60300,\"currency\":\"USD\",\"kind\":\"cheque\",\"fullname\":null,\"email\":null,\"locale\":null,\"ip\":null,\"test\":null,\"notes\":null,\"paid_at\":\"2014-03-06T13:19:13Z\",\"created_at\":\"2014-04-14T13:19:13Z\",\"updated_at\":\"2014-04-22T11:45:07Z\",\"rejected_at\":null,\"canceled_at\":\"2014-04-22T11:45:07Z\"}]}"
    http_version:
  recorded_at: Tue, 22 Apr 2014 12:00:18 GMT
recorded_with: VCR 2.9.0
